In [2]:
import numpy as np
import pandas as pd

In [3]:
a = np.arange(16)

In [4]:
a

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15])

In [5]:
### reshape is a method in numpy and not pandas

In [6]:
df2 = pd.DataFrame({ 'A' : 1.,'B' : 
                    pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [7]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [8]:
### Indexing into a DataFrame is for retreiving one or more columns either with a single value or sequence.
df2['C']

0    1.0
1    1.0
2    1.0
3    1.0
Name: C, dtype: float32

In [10]:
df2[['C', 'F']]

     C    F
0  1.0  foo
1  1.0  foo
2  1.0  foo
3  1.0  foo

In [11]:
### Selecting rows by slicing

df2[:2]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [12]:
df2[:3]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo

In [14]:
### Selecting rows by some condition

### Column C has only values '1' and so anything other than '>0' will return nothing
df2[df2['C']>0]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [15]:
### You can test the same condition on column 'D'

df2[df2['D']>3]

Empty DataFrame
Columns: [A, B, C, D, E, F]
Index: []

In [17]:
### Assigning values to a column in the data frame

df2['C'] = np.arange(4)

In [19]:
df2

     A          B  C  D      E    F
0  1.0 2013-01-02  0  3   test  foo
1  1.0 2013-01-02  1  3  train  foo
2  1.0 2013-01-02  2  3   test  foo
3  1.0 2013-01-02  3  3  train  foo

In [22]:
df2[df2['C']>=1]

     A          B  C  D      E    F
1  1.0 2013-01-02  1  3  train  foo
2  1.0 2013-01-02  2  3   test  foo
3  1.0 2013-01-02  3  3  train  foo

In [24]:
### Another use case in indexing with a Boolean DataFrame such as one produced by a Scalar comparison

df2['C'] < 3

0     True
1     True
2     True
3    False
Name: C, dtype: bool

In [29]:
## Create a dataframe from a numpy matrix

a = np.matrix('1 2 3 4; 5 6 7 8; 9 10 11 12; 13 14 15 16')
df1 = pd.DataFrame(a)

In [30]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [31]:
df1 < 5

       0      1      2      3
0   True   True   True   True
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False

In [ ]:
### The same method (Scalar comparison) can also be used for assignment purpose.

In [32]:
df1[df1 < 5] = 12

In [33]:
df1

    0   1   2   3
0  12  12  12  12
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [34]:
matrixA={}
matrixA['a']=[12,12,15,18]
matrixA['b']=[1,45,62,4]
matrixA['c']=[2,12,5,18]
matrixA['d']=[1,5,6,41]
pd.DataFrame(matrixA)

    a   b   c   d
0  12   1   2   1
1  12  45  12   5
2  15  62   5   6
3  18   4  18  41

In [35]:
df3 = pd.DataFrame(matrixA)

In [36]:
df3

    a   b   c   d
0  12   1   2   1
1  12  45  12   5
2  15  62   5   6
3  18   4  18  41

In [42]:
### For DataFrame label-indexing on the rows, we could use the indexing field ix. 
### It enables us to select a subset of the rows and columns from a DataFrame with NumPy like notation plus axis labels.
### This is also a less verbose way to do reindexing

### Before that, lets rename the row labels

df3.index = ['Chennai','Pune','Mumbai','Bangalore']

In [43]:
df3

            a   b   c   d
Chennai    12   1   2   1
Pune       12  45  12   5
Mumbai     15  62   5   6
Bangalore  18   4  18  41

In [50]:
###The 'cities' string was set as the index name. We are gonna remove it.

In [51]:
df3

            a   b   c   d
Cities
Chennai    12   1   2   1
Pune       12  45  12   5
Mumbai     15  62   5   6
Bangalore  18   4  18  41

In [53]:
del df3.index.name

In [54]:
### Now check your dataframe

In [55]:
df3

            a   b   c   d
Chennai    12   1   2   1
Pune       12  45  12   5
Mumbai     15  62   5   6
Bangalore  18   4  18  41

In [56]:
### Hooraayyy!!!

In [57]:
### Now lets try the 'ix' method of reindexing

In [58]:
df3.ix['Chennai', ['b','c']]

b    1
c    2
Name: Chennai, dtype: int64

In [60]:
df3.ix[['Chennai','Bangalore'], ['b','c']]

           b   c
Chennai    1   2
Bangalore  4  18

In [63]:
### Printing the row with the the label-index 'Chennai'

df3.ix['Chennai']

a    12
b     1
c     2
d     1
Name: Chennai, dtype: int64

In [66]:
### The same can be achieved by using the row number, which ofcourse starts from 0

df3.ix[0]

a    12
b     1
c     2
d     1
Name: Chennai, dtype: int64

In [67]:
### Slicing works as well

df3.ix[:'Mumbai']

          a   b   c  d
Chennai  12   1   2  1
Pune     12  45  12  5
Mumbai   15  62   5  6

In [68]:
df3.ix[:'Mumbai', 'c']

Chennai     2
Pune       12
Mumbai      5
Name: c, dtype: int64